{
  "raw_response": "{\n  \"id\": \"old-english-sheepdog\",\n  \"name\": \"Old English Sheepdog\",\n  \"full_description\": \"The Old English Sheepdog (OES) is a distinctive and versatile breed, renowned for its shaggy coat and amiable disposition. Originating in the early 19th century in the western counties of England, the OES was developed primarily as a drover's dog, tasked with driving sheep and cattle to market. Its lineage likely includes the Bearded Collie and possibly the Russian Owtcharka, contributing to its robust build and herding capabilities.\\n\\nPhysically, the OES is a large, muscular dog with a square, compact frame. Males typically stand 24 inches or taller at the shoulder, while females are slightly shorter. They weigh between 70 to 100 pounds. The breed's most striking feature is its profuse double coat, which is shaggy and free from curl, coming in shades of gray, grizzle, blue, or blue merle, often with white markings. This dense coat provides insulation and protection against harsh weather conditions.\\n\\nTemperamentally, the OES is known for its gentle and friendly nature. They are intelligent, adaptable, and exhibit a playful demeanor, making them excellent companions for families. Their herding instincts may manifest as a tendency to herd children or other pets, but with proper training, this behavior can be managed effectively.\\n\\nHistorically, the OES was valued for its herding and droving abilities, adept at moving livestock over long distances. Today, while they are less commonly used for herding, they have found roles as beloved family pets and participants in dog sports. Their distinctive appearance has also made them popular in media and advertising.\\n\\nNotable characteristics of the OES include its unique \"bear-like\" gait, a result of its distinctive topline that slopes from the loin to the withers. Additionally, the breed is sometimes referred to as the \"Bobtail\" due to the traditional practice of tail docking, which was historically done to denote working status and avoid taxation.\",\n  \"parameters\": {\n    \"size\": \"large\",\n    \"weight\": \"70-100 pounds\",\n    \"height\": \"22-26 inches\",\n    \"coat\": \"long, shaggy, double coat\",\n    \"activity\": \"moderate\",\n    \"trainability\": \"moderate\",\n    \"grooming\": \"high-maintenance; requires regular brushing\",\n    \"lifespan\": \"10-12 years\"\n  },\n  \"behavior\": {\n    \"summary\": \"The Old English Sheepdog is a gentle, friendly, and intelligent breed, known for its playful and adaptable nature.\",\n    \"with_family\": \"Devoted and protective, forming strong bonds with family members.\",\n    \"with_children\": \"Good with children, though their exuberance may be overwhelming for very young kids.\",\n    \"with_other_pets\": \"Generally good with other dogs and pets, especially when socialized early.\",\n    \"with_strangers\": \"Friendly towards strangers, though may be reserved initially.\",\n    \"special_traits\": [\n      \"Playful and energetic\",\n      \"Strong herding instincts\",\n      \"Affectionate and loyal\",\n      \"Intelligent and trainable\",\n      \"Requires regular mental and physical stimulation\"\n    ]\n  },\n  \"health\": {\n    \"summary\": \"The Old English Sheepdog is generally a healthy breed but is prone to certain genetic health issues common in large breeds.\",\n    \"common_issues\": [\n      \"Hip dysplasia\",\n      \"Glaucoma\",\n      \"Cataracts\",\n      \"Progressive retinal atrophy\",\n      \"Hypothyroidism\",\n      \"Wobbler syndrome\"\n    ],\n    \"prevention_tips\": [\n      \"Regular veterinary check-ups\",\n      \"Maintain a healthy weight\",\n      \"Provide regular exercise\",\n      \"Monitor for signs of eye issues\",\n      \"Ensure a balanced diet\"\n    ],\n    \"vet_checkups\": \"At least once a year, with more frequent visits as the dog ages or if health issues arise.\"\n  },\n  \"care\": {\n    \"description\": \"Caring for an Old English Sheepdog requires commitment to regular grooming, exercise, and health monitoring to ensure a happy and healthy life.\",\n    \"behavior\": \"Provide consistent training to manage herding instincts and ensure proper socialization from a young age.\",\n    \"health\": \"Regular veterinary visits and attention to common health issues are essential for maintaining overall well-being.\",\n    \"grooming\": \"Daily brushing is recommended to prevent matting; professional grooming may be necessary periodically.\",\n    \"nutrition\": \"Feed a balanced diet appropriate for large breeds, monitoring food intake to prevent obesity.\"\n  },\n  \"faq\": [\n    {\n      \"question\": \"Do Old English Sheepdogs shed a lot?\",\n      \"answer\": \"They shed minimally but require regular grooming to maintain their coat.\"\n    },\n    {\n      \"question\": \"Are Old English Sheepdogs good for first-time dog owners?\",\n      \"answer\": \"They can be, provided the owner is prepared for their grooming needs and exercise requirements.\"\n    },\n    {\n      \"question\": \"How much exercise does an Old English Sheepdog need?\",\n      \"answer\": \"They require moderate daily exercise, such as walks and play sessions.\"\n    },\n    {\n      \"question\": \"Are Old English Sheepdogs hypoallergenic?\",\n      \"answer\": \"No, they are not considered hypoallergenic.\"\n    },\n    {\n      \"question\": \"Can Old English Sheepdogs live in apartments?\",\n      \"answer\": \"They can adapt to apartment living if provided with sufficient exercise and mental stimulation.\"\n    }\n  ],\n  \"sources\": [\n    \"https://www.ukcdogs.com/old-english-sheepdog\",\n    \"https://vcahospitals.com/know-your-pet/old-english-sheepdog\",\n    \"https://www.akc.org/expert-advice/dog-breeds/fun-facts-old-english-sheepdog/\",\n    \"https://oldenglishsheepdogclubofamerica.org/articles/article-the-old-english-sheepdog/\"\n  ]\n}"
}